walmis/xpcc/src/xpcc/architecture/platform/cortex_m3/lpc/lpc17/dma/DMA.h
    //! Width in Src transfer width and Dest transfer width definitions */
    enum GPDMA_WIDTH {
          byte     = 0UL    /*!< Width = 1 byte */
        , halfword = 1UL    /*!< Width = 2 bytes */
        , word     = 2UL    /*!< Width = 4 bytes */
    };
    
    //! DMA Request Select Mode definitions. */
    enum GPDMA_REQSEL {
          uart  = 0UL   /*!< UART TX/RX is selected */
        , timer = 1UL   /*!< Timer match is selected */
    };

    //! GPDMA Control register bits.
    enum Config {
          _E = 1        /*!< DMA Controller enable */
        , _M = 2        /*!< AHB Master endianness configuration */
    };    

    //! GPDMA Channel config register bits.
    enum CConfig {
          _CE  = (1UL << 0)     /*!< Channel enable */
        , _IE  = (1UL << 14)    /*!< Interrupt error mask */
        , _ITC = (1UL << 15)    /*!< Terminal count interrupt mask */
        , _LOCK   = (1UL << 16)    /*!< Lock */
        , _A   = (1UL << 17)    /*!< Active */
        , _H   = (1UL << 18)    /*!< Halt */
    };
    

    static DMA* instance() {
    	if(!moddma_p) {
    		moddma_p = new DMA;
    	}
    	return moddma_p;
    }
    

    /**
     * Used to setup and enable the DMA controller.
     *
     * @see Setup
     * @see Enable
     * @param c A pointer to an instance of MODDMA_Config to setup.
     */
    uint32_t Prepare(DMAConfig *c) {
        uint32_t u = Setup(c);
        if (u) Enable(c);
        return u;
    }
    
    /**
     * Used to setup the DMA controller to prepare for a data transfer.
     *
     * @param c A pointer to an instance of MODDMA_Config to setup.
     */
    uint32_t Setup(DMAConfig *c);
    
    /**
     * Enable and begin data transfer.
     *
     * @param ChannelNumber Type CHANNELS, the channel number to enable
     */
    void Enable(CHANNELS ChannelNumber);
    
    /**
     * Enable and begin data transfer (overloaded function)
     *
     * @param ChannelNumber Type uin32_t, the channel number to enable
     */
    void Enable(uint32_t ChannelNumber) { Enable((CHANNELS)(ChannelNumber & 0x7)); }
    
    /**
     * Enable and begin data transfer (overloaded function)
     *
     * @param config A pointer to teh configuration
     */
    void Enable(DMAConfig *config) { Enable( config->channelNum() ); }
        
    
    /**
     * Disable a channel and end data transfer.
     *
     * @ingroup API
     * @param ChannelNumber Type CHANNELS, the channel number to enable
     */
    void Disable(CHANNELS ChannelNumber);
    
    /**
     * Disable a channel and end data transfer (overloaded function)
     *
     * @ingroup API
     * @param ChannelNumber Type uin32_t, the channel number to disable
     */
    void Disable(uint32_t ChannelNumber) { Disable((CHANNELS)(ChannelNumber & 0x7)); }
    
    /**
     * Is the specified channel enabled?
     *
     * @param ChannelNumber Type CHANNELS, the channel number to test
     * @return bool true if enabled, false otherwise.
     */
    bool Enabled(CHANNELS ChannelNumber);
    
    /**
     * Is the specified channel enabled? (overloaded function)
     *
      * @param ChannelNumber Type uin32_t, the channel number to test
     * @return bool true if enabled, false otherwise.
     */
    bool Enabled(uint32_t ChannelNumber) { return Enabled((CHANNELS)(ChannelNumber & 0x7)); }
    
    __INLINE uint32_t IntStat(uint32_t n)            { return (1UL << n) & 0xFF; }
    __INLINE uint32_t IntTCStat_Ch(uint32_t n)       { return (1UL << n) & 0xFF; }
    __INLINE uint32_t IntTCClear_Ch(uint32_t n)      { return (1UL << n) & 0xFF; }
    __INLINE uint32_t IntErrStat_Ch(uint32_t n)      { return (1UL << n) & 0xFF; }
    __INLINE uint32_t IntErrClr_Ch(uint32_t n)       { return (1UL << n) & 0xFF; }
    __INLINE uint32_t RawIntErrStat_Ch(uint32_t n)   { return (1UL << n) & 0xFF; }
    __INLINE uint32_t EnbldChns_Ch(uint32_t n)       { return (1UL << n) & 0xFF; }
    __INLINE uint32_t SoftBReq_Src(uint32_t n)       { return (1UL << n) & 0xFFFF; }
    __INLINE uint32_t SoftSReq_Src(uint32_t n)       { return (1UL << n) & 0xFFFF; }
    __INLINE uint32_t SoftLBReq_Src(uint32_t n)      { return (1UL << n) & 0xFFFF; }
    __INLINE uint32_t SoftLSReq_Src(uint32_t n)      { return (1UL << n) & 0xFFFF; }
    __INLINE uint32_t Sync_Src(uint32_t n)           { return (1UL << n) & 0xFFFF; }
    __INLINE uint32_t ReqSel_Input(uint32_t n)       { return (1UL << (n - 8)) & 0xFF; }
    

    __INLINE uint32_t CxControl_TransferSize(uint32_t n)     { return (n & 0xFFF) << 0; }
    __INLINE uint32_t CxControl_SBSize(uint32_t n)           { return (n & 0x7) << 12; }
    __INLINE uint32_t CxControl_DBSize(uint32_t n)           { return (n & 0x7) << 15; }
    __INLINE uint32_t CxControl_SWidth(uint32_t n)           { return (n & 0x7) << 18; }
    __INLINE uint32_t CxControl_DWidth(uint32_t n)           { return (n & 0x7) << 21; }
    __INLINE uint32_t CxControl_SI()                         { return (1UL << 26); }
    __INLINE uint32_t CxControl_DI()                         { return (1UL << 27); }
    __INLINE uint32_t CxControl_Prot1()                      { return (1UL << 28); }
    __INLINE uint32_t CxControl_Prot2()                      { return (1UL << 29); }
    __INLINE uint32_t CxControl_Prot3()                      { return (1UL << 30); }
    __INLINE uint32_t CxControl_I()                          { return (1UL << 31); }
    __INLINE uint32_t CxControl_E()                          { return (1UL << 0); }
    __INLINE uint32_t CxConfig_SrcPeripheral(uint32_t n)     { return (n & 0x1F) << 1; }
    __INLINE uint32_t CxConfig_DestPeripheral(uint32_t n)    { return (n & 0x1F) << 6; }
    __INLINE uint32_t CxConfig_TransferType(uint32_t n)      { return (n & 0x7) << 11; }
    __INLINE uint32_t CxConfig_IE()                          { return (1UL << 14); }
    __INLINE uint32_t CxConfig_ITC()                         { return (1UL << 15); }
    __INLINE uint32_t CxConfig_L()                           { return (1UL << 16); }
    __INLINE uint32_t CxConfig_A()                           { return (1UL << 17); }
    __INLINE uint32_t CxConfig_H()                           { return (1UL << 18); }
    
    /**
     * A store for up to 8 (8 channels) of configurations.
     * @see MODDMA_Config
     */
    DMAConfig *setups[8];
    
    /**
     * Get a pointer to the current configuration the ISR is servicing.
     *
     * @return MODDMA_Config * A pointer to the setup the ISR is currently servicing.
     */
    DMAConfig *getConfig(void) { return setups[IrqProcessingChannel]; }
    
    
    /**
     * Gets which channel the ISR is currently servicing.
     *
     * @return CHANNELS The current channel the ISR is servicing.
     */
    CHANNELS irqProcessingChannel(void) { return IrqProcessingChannel; }
    
    /**
     * Sets which type of IRQ the ISR is making a callback for.
     *
     * *** USED INTERNALLY. DO NOT CALL FROM USER PROGRAMS ***
     *
     * Must be public so the extern "C" ISR can use it.
     */ 
    void setIrqType(IrqType_t n) { IrqType = n; }
    
    /**
     * Get which type of IRQ the ISR is calling you about,
     * terminal count or error.
     */
    IrqType_t irqType(void) { return IrqType; }
    
    /**
     * Clear the interrupt after handling.
     *
     * @param CHANNELS The channel the IQR occured on.
     */
    void clearTcIrq(CHANNELS n) { LPC_GPDMA->DMACIntTCClear = (uint32_t)(1UL << n); } 
    
    /**
     * Clear the interrupt the ISR is currently handing..
     */
    void clearTcIrq(void) { clearTcIrq( IrqProcessingChannel ); }
    
    /**
     * Clear the error interrupt after handling.
     *
     * @ingroup API
     * @param CHANNELS The channel the IQR occured on.
     */
    void clearErrIrq(CHANNELS n) { LPC_GPDMA->DMACIntTCClear = (uint32_t)(1UL << n); } 
    
    /**
     * Clear the error interrupt the ISR is currently handing.
     * @ingroup API
     */
    void clearErrIrq(void) { clearErrIrq( IrqProcessingChannel ); }
   
    /**
     * Is the supplied channel currently active?
     *
     * @ingroup API
     * @param CHANNELS The channel to inquire about.
     * @return bool true if active, false otherwise.
     */     
    bool isActive(CHANNELS ChannelNumber) {
        LPC_GPDMACH_TypeDef *pChannel = (LPC_GPDMACH_TypeDef *)Channel_p( ChannelNumber );
        return (bool)( pChannel->DMACCConfig & CxConfig_A() ) ;
    }

    bool isActive(DMAConfig* config) {
    	return isActive((CHANNELS)config->channelNum());
    }
    
    /**
     * Halt the supplied channel. 
     *
     * @ingroup API
     * @param CHANNELS The channel to halt.
     */
    void haltChannel(CHANNELS ChannelNumber);
    
    /**
     * get a channels control register. 
     *
     * @ingroup API
     * @param CHANNELS The channel to get the control register for.
     */
    uint32_t getControl(CHANNELS ChannelNumber);
    
    /**
     * Wait for channel transfer to complete and then halt.
     *
     * @ingroup API
     * @param CHANNELS The channel to wait for then halt.
     */
    void haltAndWaitChannelComplete(CHANNELS n) { haltChannel(n); while (isActive(n)); }
    
    /**
     * Attach a callback to the TC IRQ controller.
     *
     * @param fptr A function pointer to call
     * @return this
     */
    void attach_tc(void (*fptr)(void)) {  
        isrIntTCStat.attach(fptr);         
    }
    
    /**
     * Attach a callback to the TC IRQ controller.
     *
     * @ingroup API
     * @param tptr A template pointer to the calling object
     * @param mptr A method pointer within the object to call.
     * @return this
     */
    template<typename T>
    void attach_tc(T* tptr, void (T::*mptr)(void)) {  
        if((mptr != NULL) && (tptr != NULL)) {
            isrIntTCStat.attach(tptr, mptr);         
        }        
    }
       
    /**
     * The MODDMA controllers terminal count interrupt callback.
     */
    FunctionPointer isrIntTCStat;                        
    
    /**
     * Attach a callback to the ERR IRQ controller.
     *
     * @param fptr A function pointer to call
     * @return this
     */
    void attach_err(void (*fptr)(void)) {  
        isrIntErrStat.attach(fptr);                 
    }
    
    /**
     * Attach a callback to the ERR IRQ controller.
     *
     * @param tptr A template pointer to the calling object
     * @param mptr A method pointer within the object to call.
     * @return this
     */
    template<typename T>
    void attach_err(T* tptr, void (T::*mptr)(void)) {  
        if((mptr != NULL) && (tptr != NULL)) {
            isrIntErrStat.attach(tptr, mptr);         
        }
    }
    
    /**
     * Get the Linked List index regsiter for the requested channel.
     *
     * @param channelNum The channel number.
     * @return uint32_t The value of the DMACCLLI register
     */
    uint32_t lli(CHANNELS ChannelNumber, DMALLI *set = 0) { 
        LPC_GPDMACH_TypeDef *pChannel = (LPC_GPDMACH_TypeDef *)Channel_p( ChannelNumber & 0x7 );
        if (set) pChannel->DMACCLLI = (uint32_t)set;
        return pChannel->DMACCLLI; 
    }
    
    /**
     * The MODDMA controllers error interrupt callback.
     */
    FunctionPointer isrIntErrStat;                        
    
    uint32_t Channel_p(int channel) {
        const uint32_t lut[] = {
              (uint32_t)LPC_GPDMACH0
            , (uint32_t)LPC_GPDMACH1
            , (uint32_t)LPC_GPDMACH2
            , (uint32_t)LPC_GPDMACH3
            , (uint32_t)LPC_GPDMACH4
            , (uint32_t)LPC_GPDMACH5
            , (uint32_t)LPC_GPDMACH6
            , (uint32_t)LPC_GPDMACH7
        };
        return lut[channel & 0xFF];
    }
    
protected:

    /**
     * Set which channel the ISR is currently servicing.
     *
     * *** USED INTERNALLY. DO NOT CALL FROM USER PROGRAMS ***
     *
     * Must be public so the extern "C" ISR can use it.
     */
    void setIrqProcessingChannel(CHANNELS n) { IrqProcessingChannel = n; }

    /**
     * The MODDMA constructor is used to initialise the DMA controller object.
     */
    DMA() { init(true); }

    /**
     * The MODDMA destructor.
     */
    ~DMA() {}

    /**
     * Used to setup the DMA controller to prepare for a data transfer.
     *
     * @ingroup API
     * @param isConstructorCalling Set true when called from teh constructor
     * @param
     */
    void init(bool isConstructorCalling, int Channels = 0xFF, int Tc = 0xFF, int Err = 0xFF);
   
    // Data LUTs.
    uint32_t LUTPerAddr(int n) {
        const uint32_t lut[] = {
              (uint32_t)&LPC_SSP0->DR         // SSP0 Tx
            , (uint32_t)&LPC_SSP0->DR         // SSP0 Rx
            , (uint32_t)&LPC_SSP1->DR         // SSP1 Tx
            , (uint32_t)&LPC_SSP1->DR         // SSP1 Rx
            , (uint32_t)&LPC_ADC->ADGDR       // ADC
            , (uint32_t)&LPC_I2S->I2STXFIFO   // I2S Tx
            , (uint32_t)&LPC_I2S->I2SRXFIFO   // I2S Rx
            , (uint32_t)&LPC_DAC->DACR        // DAC
            , (uint32_t)&LPC_UART0->THR       // UART0 Tx
            , (uint32_t)&LPC_UART0->RBR       // UART0 Rx
            , (uint32_t)&LPC_UART1->THR       // UART1 Tx
            , (uint32_t)&LPC_UART1->RBR       // UART1 Rx
            , (uint32_t)&LPC_UART2->THR       // UART2 Tx
            , (uint32_t)&LPC_UART2->RBR       // UART2 Rx
            , (uint32_t)&LPC_UART3->THR       // UART3 Tx
            , (uint32_t)&LPC_UART3->RBR       // UART3 Rx
            , (uint32_t)&LPC_TIM0->MR0        // MAT0.0
            , (uint32_t)&LPC_TIM0->MR1        // MAT0.1
            , (uint32_t)&LPC_TIM1->MR0        // MAT1.0
            , (uint32_t)&LPC_TIM1->MR1        // MAT1.1
            , (uint32_t)&LPC_TIM2->MR0        // MAT2.0
            , (uint32_t)&LPC_TIM2->MR1        // MAT2.1
            , (uint32_t)&LPC_TIM3->MR0        // MAT3.0
            , (uint32_t)&LPC_TIM3->MR1        // MAT3.1
        };
        return lut[n & 0xFF];
    }
    uint8_t  LUTPerBurst(int n) {
        const uint8_t lut[] = {
              (uint8_t)_4       // SSP0 Tx
            , (uint8_t)_4       // SSP0 Rx
            , (uint8_t)_4       // SSP1 Tx
            , (uint8_t)_4       // SSP1 Rx
            , (uint8_t)_1       // ADC
            , (uint8_t)_32      // I2S channel 0
            , (uint8_t)_32      // I2S channel 1
            , (uint8_t)_1       // DAC
            , (uint8_t)_1       // UART0 Tx
            , (uint8_t)_1       // UART0 Rx
            , (uint8_t)_1       // UART1 Tx
            , (uint8_t)_1       // UART1 Rx
            , (uint8_t)_1       // UART2 Tx
            , (uint8_t)_1       // UART2 Rx
            , (uint8_t)_1       // UART3 Tx
            , (uint8_t)_1       // UART3 Rx
            , (uint8_t)_1       // MAT0.0
            , (uint8_t)_1       // MAT0.1
            , (uint8_t)_1       // MAT1.0
            , (uint8_t)_1       // MAT1.1
            , (uint8_t)_1       // MAT2.0
            , (uint8_t)_1       // MAT2.1
            , (uint8_t)_1       // MAT3.0
            , (uint8_t)_1       // MAT3.1
        };
        return lut[n & 0xFFF];
    }
    uint8_t  LUTPerWid(int n) {
        const uint8_t lut[] = {
              (uint8_t)byte      // SSP0 Tx
            , (uint8_t)byte      // SSP0 Rx
            , (uint8_t)byte      // SSP1 Tx
            , (uint8_t)byte      // SSP1 Rx
            , (uint8_t)word      // ADC
            , (uint8_t)word      // I2S channel 0
            , (uint8_t)word      // I2S channel 1
            , (uint8_t)word      // DAC
            , (uint8_t)byte      // UART0 Tx
            , (uint8_t)byte      // UART0 Rx
            , (uint8_t)byte      // UART1 Tx
            , (uint8_t)byte      // UART1 Rx
            , (uint8_t)byte      // UART2 Tx
            , (uint8_t)byte      // UART2 Rx
            , (uint8_t)byte      // UART3 Tx
            , (uint8_t)byte      // UART3 Rx
            , (uint8_t)word      // MAT0.0
            , (uint8_t)word      // MAT0.1
            , (uint8_t)word      // MAT1.0
            , (uint8_t)word      // MAT1.1
            , (uint8_t)word      // MAT2.0
            , (uint8_t)word      // MAT2.1
            , (uint8_t)word      // MAT3.0
            , (uint8_t)word      // MAT3.1
        };
        return lut[n & 0xFFF];
    }
    //uint32_t Channel_p(int channel);
    
    CHANNELS IrqProcessingChannel;
    
    IrqType_t IrqType;


    friend void ::DMA_IRQHandler();

    static DMA* moddma_p;
};

};
}

#endif
